***Для участия в отборе необходимо выполнить все 5 заданий и вкоммитать их в git репозиторий ОДНИМ проектом. Ссылка на репозиторий должна быть прикреплена к форме регистрации в соответствующем поле.***

***Задание должно быть выполнено на языке Javaю***

***Решение каждой задачи должно лежать в отдельном пакете проекта.***

***Приветствуется соответствие принципам ООП и сильного сцепления.***

***Все сообщения должны быть выведены пользователю в консоль с помощью метода System.out.print(ln).***

Задания

1. Напишите программу, которая возвращает сумму цифр, присутствующих в данной строке. Если цифр нет, то возвращаемая сумма должна быть равна 0.

2. Создайте программу, которая будет вычислять и выводить на экран простые множители, из которых состоит целое число, введенное пользователем. Если введенное число не целое, то нужно сообщать пользователю об ошибке.

3. Создайте программу, которая будет:

​	-подсчитывать количество гласных в словах

​	-выводить слова отсортированным списком по количеству гласных (сначала те, у которых больше гласных)

​	-делать первую гласную букву в слове заглавной

Предложение вводится пользователем вручную русскими буквами. Разделитель пробел (" ").

4. Создайте программу, которая будет получать число и печатать его в следующем формате (формы цифр можно придумать свои, главное, чтобы они читались на экране):

41072814 из Shift+8 длина=6 высота=7

(Shift+8) Дополнительно: сделайте так, чтобы наибольшая цифра состояла не из 'Shift+8', а из соответствующих маленьких (обычных) цифр. 

5. Есть набор предметов, задаваемый заранее, предметы могут повторяться. Предмет имеет 2 параметра (обязательных, остальные добавлять на усмотрение): объем (целое значение) и ценность (целое значение). Предметы неделимы. Также задается сейф с обязательным параметром его объема (целое значение).

Нужно написать программу, которая наполняет сейф набором предметов таким образом, чтобы ценность этого набора была максимальной.

**Критерии оценки**

1. Работоспособность и соответствие условиям задачи.
2. Оптимальность выбранного решения.
3. Стиль кода.